zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz4010ca80144-pinctrl.h
/* pc27d_sercom5_pad2 */
#define PC27D_SERCOM5_PAD2 MCHP_PINMUX(c, 27, d, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28d_sercom5_pad3 */
#define PC28D_SERCOM5_PAD3 MCHP_PINMUX(c, 28, d, periph)

/* pc29_gpio */
#define PC29_GPIO MCHP_PINMUX(c, 29, gpio, gpio)

/* pc29a_eic_extint13 */
#define PC29A_EIC_EXTINT13 MCHP_PINMUX(c, 29, a, periph)

/* pc29f_tcc4_wo0 */
#define PC29F_TCC4_WO0 MCHP_PINMUX(c, 29, f, periph)

/* pc29h_can3_rx */
#define PC29H_CAN3_RX MCHP_PINMUX(c, 29, h, periph)

/* pd0_gpio */
#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

/* pd0a_eic_extint0 */
#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

/* pd0m_gclk_io2 */
#define PD0M_GCLK_IO2 MCHP_PINMUX(d, 0, m, periph)

/* pd1_gpio */
#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

/* pd1a_eic_extint1 */
#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

/* pd1m_gclk_io3 */
#define PD1M_GCLK_IO3 MCHP_PINMUX(d, 1, m, periph)

/* pd2_gpio */
#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

/* pd2a_eic_extint2 */
#define PD2A_EIC_EXTINT2 MCHP_PINMUX(d, 2, a, periph)

/* pd2f_tcc9_wo4 */
#define PD2F_TCC9_WO4 MCHP_PINMUX(d, 2, f, periph)

/* pd2j_spi_ixs0_fsync */
#define PD2J_SPI_IXS0_FSYNC MCHP_PINMUX(d, 2, j, periph)

/* pd2k_eth_gtxer */
#define PD2K_ETH_GTXER MCHP_PINMUX(d, 2, k, periph)

/* pd3_gpio */
#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

/* pd3a_eic_extint3 */
#define PD3A_EIC_EXTINT3 MCHP_PINMUX(d, 3, a, periph)

/* pd3d_sercom3_pad0 */
#define PD3D_SERCOM3_PAD0 MCHP_PINMUX(d, 3, d, periph)

/* pd3f_tcc9_wo3 */
#define PD3F_TCC9_WO3 MCHP_PINMUX(d, 3, f, periph)

/* pd3j_spi_ixs0_sdi */
#define PD3J_SPI_IXS0_SDI MCHP_PINMUX(d, 3, j, periph)

/* pd3k_eth_gtx3 */
#define PD3K_ETH_GTX3 MCHP_PINMUX(d, 3, k, periph)

/* pd4_gpio */
#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

/* pd4a_eic_extint4 */
#define PD4A_EIC_EXTINT4 MCHP_PINMUX(d, 4, a, periph)

/* pd4d_sercom3_pad1 */
#define PD4D_SERCOM3_PAD1 MCHP_PINMUX(d, 4, d, periph)

/* pd4f_tcc9_wo0 */
#define PD4F_TCC9_WO0 MCHP_PINMUX(d, 4, f, periph)

/* pd4j_spi_ixs0_sck */
#define PD4J_SPI_IXS0_SCK MCHP_PINMUX(d, 4, j, periph)

/* pd4k_eth_gtx2 */
#define PD4K_ETH_GTX2 MCHP_PINMUX(d, 4, k, periph)

/* pd5_gpio */
#define PD5_GPIO MCHP_PINMUX(d, 5, gpio, gpio)

/* pd5a_eic_extint5 */
#define PD5A_EIC_EXTINT5 MCHP_PINMUX(d, 5, a, periph)

/* pd5d_sercom3_pad2 */
#define PD5D_SERCOM3_PAD2 MCHP_PINMUX(d, 5, d, periph)

/* pd5f_tcc9_wo1 */
#define PD5F_TCC9_WO1 MCHP_PINMUX(d, 5, f, periph)

/* pd5j_spi_ixs0_sdo */
#define PD5J_SPI_IXS0_SDO MCHP_PINMUX(d, 5, j, periph)

/* pd5k_eth_txck */
#define PD5K_ETH_TXCK MCHP_PINMUX(d, 5, k, periph)

/* pd5l_eth_gtxck */
#define PD5L_ETH_GTXCK MCHP_PINMUX(d, 5, l, periph)

/* pd6_gpio */
#define PD6_GPIO MCHP_PINMUX(d, 6, gpio, gpio)

/* pd6a_eic_extint6 */
#define PD6A_EIC_EXTINT6 MCHP_PINMUX(d, 6, a, periph)

/* pd6d_sercom3_pad3 */
#define PD6D_SERCOM3_PAD3 MCHP_PINMUX(d, 6, d, periph)

/* pd6f_tcc9_wo2 */
#define PD6F_TCC9_WO2 MCHP_PINMUX(d, 6, f, periph)

/* pd6j_spi_ixs0_mclk0 */
#define PD6J_SPI_IXS0_MCLK0 MCHP_PINMUX(d, 6, j, periph)

/* pd6k_eth_grx3 */
#define PD6K_ETH_GRX3 MCHP_PINMUX(d, 6, k, periph)

/* pd7_gpio */
#define PD7_GPIO MCHP_PINMUX(d, 7, gpio, gpio)

/* pd7a_eic_extint7 */
#define PD7A_EIC_EXTINT7 MCHP_PINMUX(d, 7, a, periph)

/* pd7f_tcc7_wo1 */
#define PD7F_TCC7_WO1 MCHP_PINMUX(d, 7, f, periph)

/* pd7g_mlb_mlbc */
#define PD7G_MLB_MLBC MCHP_PINMUX(d, 7, g, periph)

/* pd7k_eth_grx2 */
#define PD7K_ETH_GRX2 MCHP_PINMUX(d, 7, k, periph)

/* pd8_gpio */
#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

/* pd8a_eic_extint8 */
#define PD8A_EIC_EXTINT8 MCHP_PINMUX(d, 8, a, periph)

/* pd8f_tcc7_wo0 */
#define PD8F_TCC7_WO0 MCHP_PINMUX(d, 8, f, periph)

/* pd8g_mlb_mlbs */
#define PD8G_MLB_MLBS MCHP_PINMUX(d, 8, g, periph)

/* pd8h_can1_rx */
#define PD8H_CAN1_RX MCHP_PINMUX(d, 8, h, periph)

/* pd8k_eth_gcol */
#define PD8K_ETH_GCOL MCHP_PINMUX(d, 8, k, periph)

/* pd9_gpio */
#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

/* pd9a_eic_extint9 */
#define PD9A_EIC_EXTINT9 MCHP_PINMUX(d, 9, a, periph)

/* pd9g_mlb_mlbd */
#define PD9G_MLB_MLBD MCHP_PINMUX(d, 9, g, periph)

/* pd9h_can1_tx */
#define PD9H_CAN1_TX MCHP_PINMUX(d, 9, h, periph)

/* pd9k_eth_gcrs */
#define PD9K_ETH_GCRS MCHP_PINMUX(d, 9, k, periph)

/* pd10_gpio */
#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

/* pd10a_eic_extint10 */
#define PD10A_EIC_EXTINT10 MCHP_PINMUX(d, 10, a, periph)

/* pd10f_tcc2_wo0 */
#define PD10F_TCC2_WO0 MCHP_PINMUX(d, 10, f, periph)

/* pd10k_eth_grx1 */
#define PD10K_ETH_GRX1 MCHP_PINMUX(d, 10, k, periph)

/* pd11_gpio */
#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

/* pd11a_eic_extint11 */
#define PD11A_EIC_EXTINT11 MCHP_PINMUX(d, 11, a, periph)

/* pd11d_sercom2_pad0 */
#define PD11D_SERCOM2_PAD0 MCHP_PINMUX(d, 11, d, periph)

/* pd11f_tcc2_wo1 */
#define PD11F_TCC2_WO1 MCHP_PINMUX(d, 11, f, periph)

/* pd11k_eth_grx0 */
#define PD11K_ETH_GRX0 MCHP_PINMUX(d, 11, k, periph)

/* pd12_gpio */
#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

/* pd12a_eic_extint12 */
#define PD12A_EIC_EXTINT12 MCHP_PINMUX(d, 12, a, periph)

/* pd12d_sercom2_pad1 */
#define PD12D_SERCOM2_PAD1 MCHP_PINMUX(d, 12, d, periph)

/* pd12f_tcc2_wo2 */
#define PD12F_TCC2_WO2 MCHP_PINMUX(d, 12, f, periph)

/* pd12k_eth_grefck */
#define PD12K_ETH_GREFCK MCHP_PINMUX(d, 12, k, periph)

/* pd12l_eth_grefck */
#define PD12L_ETH_GREFCK MCHP_PINMUX(d, 12, l, periph)

/* pd13_gpio */
#define PD13_GPIO MCHP_PINMUX(d, 13, gpio, gpio)

/* pd13a_eic_extint14 */
#define PD13A_EIC_EXTINT14 MCHP_PINMUX(d, 13, a, periph)

/* pd13f_tcc4_wo1 */
#define PD13F_TCC4_WO1 MCHP_PINMUX(d, 13, f, periph)

/* pd13h_can3_tx */
#define PD13H_CAN3_TX MCHP_PINMUX(d, 13, h, periph)

/* pd14_gpio */
#define PD14_GPIO MCHP_PINMUX(d, 14, gpio, gpio)

/* pd14a_eic_extint15 */
#define PD14A_EIC_EXTINT15 MCHP_PINMUX(d, 14, a, periph)

/* pd14k_eth_gtx7 */
#define PD14K_ETH_GTX7 MCHP_PINMUX(d, 14, k, periph)

/* pd15_gpio */
#define PD15_GPIO MCHP_PINMUX(d, 15, gpio, gpio)

/* pd15a_eic_extint0 */
#define PD15A_EIC_EXTINT0 MCHP_PINMUX(d, 15, a, periph)

