zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz4010ca80144-pinctrl.h
/* pd15k_eth_gtx6 */
#define PD15K_ETH_GTX6 MCHP_PINMUX(d, 15, k, periph)

/* pd16_gpio */
#define PD16_GPIO MCHP_PINMUX(d, 16, gpio, gpio)

/* pd16a_eic_extint1 */
#define PD16A_EIC_EXTINT1 MCHP_PINMUX(d, 16, a, periph)

/* pd16k_eth_gtx5 */
#define PD16K_ETH_GTX5 MCHP_PINMUX(d, 16, k, periph)

/* pd17_gpio */
#define PD17_GPIO MCHP_PINMUX(d, 17, gpio, gpio)

/* pd17a_eic_extint2 */
#define PD17A_EIC_EXTINT2 MCHP_PINMUX(d, 17, a, periph)

/* pd17k_eth_gtx4 */
#define PD17K_ETH_GTX4 MCHP_PINMUX(d, 17, k, periph)

/* pd18_gpio */
#define PD18_GPIO MCHP_PINMUX(d, 18, gpio, gpio)

/* pd18a_eic_extint3 */
#define PD18A_EIC_EXTINT3 MCHP_PINMUX(d, 18, a, periph)

/* pd18k_eth_grx7 */
#define PD18K_ETH_GRX7 MCHP_PINMUX(d, 18, k, periph)

/* pd18m_gclk_io4 */
#define PD18M_GCLK_IO4 MCHP_PINMUX(d, 18, m, periph)

/* pd19_gpio */
#define PD19_GPIO MCHP_PINMUX(d, 19, gpio, gpio)

/* pd19a_eic_extint4 */
#define PD19A_EIC_EXTINT4 MCHP_PINMUX(d, 19, a, periph)

/* pd19k_eth_grx6 */
#define PD19K_ETH_GRX6 MCHP_PINMUX(d, 19, k, periph)

/* pd19m_gclk_io5 */
#define PD19M_GCLK_IO5 MCHP_PINMUX(d, 19, m, periph)

/* pd20_gpio */
#define PD20_GPIO MCHP_PINMUX(d, 20, gpio, gpio)

/* pd20a_eic_extint5 */
#define PD20A_EIC_EXTINT5 MCHP_PINMUX(d, 20, a, periph)

/* pd20k_eth_grx4 */
#define PD20K_ETH_GRX4 MCHP_PINMUX(d, 20, k, periph)

/* pd20m_gclk_io6 */
#define PD20M_GCLK_IO6 MCHP_PINMUX(d, 20, m, periph)

/* pd21_gpio */
#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

/* pd21a_eic_extint6 */
#define PD21A_EIC_EXTINT6 MCHP_PINMUX(d, 21, a, periph)

/* pd21k_eth_grx5 */
#define PD21K_ETH_GRX5 MCHP_PINMUX(d, 21, k, periph)

/* pd21m_gclk_io7 */
#define PD21M_GCLK_IO7 MCHP_PINMUX(d, 21, m, periph)

#endif /* MICROCHIP_PIC32CZ4010CA80144_PINCTRL_H_ */
